{
    "folio_generated_utc": "2025-07-31T07:16:30.305059+00:00",
    "date": "July 31, 2025",
    "theme": "On Faith & Doubt",
    "passages": [
        {
            "reference": "Genesis 15:1-6",
            "kjv_text": "After these things the word of the LORD came unto Abram in a vision, saying, Fear not, Abram: I am thy shield, and thy exceeding great reward. And Abram said, Lord GOD, what wilt thou give me, seeing I go childless, and the steward of my house is this Eliezer of Damascus? And Abram said, Behold, to me thou hast given no seed: and, lo, one born in my house is mine heir. And, behold, the word of the LORD came unto him, saying, This shall not be thine heir; but he that shall come forth out of thine own bowels shall be thine heir. And he brought him forth abroad, and said, Look now toward heaven, and tell the stars, if thou be able to number them: and he said unto him, So shall thy seed be. And he believed in the LORD; and he counted it to him for righteousness.",
            "web_text": "After these things Yahweh’s word came to Abram in a vision, saying, “Don’t be afraid, Abram. I am your shield, your exceedingly great reward.” Abram said, “Lord Yahweh, what will you give me, since I go childless, and he who will inherit my estate is Eliezer of Damascus?” Abram said, “Behold, to me you have given no children: and, behold, one born in my house is my heir.” Behold, Yahweh’s word came to him, saying, “This man will not be your heir, but he who will come out of your own body will be your heir.” Yahweh brought him outside, and said, “Look now toward the sky, and count the stars, if you are able to count them.” He said to Abram, “So will your offspring be.” He believed in Yahweh, who credited it to him for righteousness."
        },
        {
            "reference": "Mark 9:14-24",
            "kjv_text": "And when he came to his disciples, he saw a great multitude about them, and the scribes questioning with them. And straightway all the people, when they beheld him, were greatly amazed, and running to him saluted him. And he asked the scribes, What question ye with them? And one of the multitude answered and said, Master, I have brought unto thee my son, which hath a dumb spirit; And wheresoever he taketh him, he teareth him: and he foameth, and gnasheth with his teeth, and pineth away: and I spake to thy disciples that they should cast him out; and they could not. He answereth him, and saith, O faithless generation, how long shall I be with you? how long shall I suffer you? bring him unto me. And they brought him unto him: and when he saw him, straightway the spirit tare him; and he fell on the ground, and wallowed foaming. And he asked his father, How long is it ago since this came unto him? And he said, Of a child. And ofttimes it hath cast him into the fire, and into the waters, to destroy him: but if thou canst do any thing, have compassion on us, and help us. Jesus said unto him, If thou canst believe, all things are  possible to him that believeth. And straightway the father of the child cried out, and said with tears, Lord, I believe; help thou mine unbelief.",
            "web_text": "Coming to the disciples, he saw a great multitude around them, and scribes questioning them. Immediately all the multitude, when they saw him, were greatly amazed, and running to him, greeted him. He asked the scribes, “What are you asking them?” One of the multitude answered, “Teacher, I brought to you my son, who has a mute spirit; and wherever it seizes him, it throws him down, and he foams at the mouth, and grinds his teeth, and wastes away. I asked your disciples to cast it out, and they weren’t able.” He answered him, “Unbelieving generation, how long shall I be with you? How long shall I bear with you? Bring him to me.” They brought him to him, and when he saw him, immediately the spirit convulsed him, and he fell on the ground, wallowing and foaming at the mouth. He asked his father, “How long has it been since this has come to him?” He said, “From childhood. Often it has cast him both into the fire and into the water, to destroy him. But if you can do anything, have compassion on us, and help us.” Jesus said to him, “If you can believe, all things are possible to him who believes.” Immediately the father of the child cried out with tears, “I believe. Help my unbelief!”"
        }
    ],
    "notes": {
        "context": "Abram is promised descendants as numerous as the stars, a seemingly impossible feat. His belief is 'credited to him as righteousness.' In Mark, a desperate father utters one of the most honest prayers in scripture, confessing both his faith and his doubt simultaneously.",
        "reflection": "True faith is not the absence of doubt, but the courage to cry out 'I believe; help my unbelief!' in the face of it. Where do our faith and doubt intersect today?",
        "cross_references": [
            "Hebrews 11:1",
            "James 1:6",
            "Romans 4:20-21"
        ]
    }
}