{
    "folio_generated_utc": "2025-07-27T07:00:14.318920+00:00",
    "date": "July 27, 2025",
    "theme": "On Justice & The Oppressed",
    "passages": [
        {
            "reference": "Amos 5:24",
            "kjv_text": "But let judgment run down as waters, and righteousness as a mighty stream.",
            "web_text": "But let justice roll on like rivers, and righteousness like a mighty stream."
        },
        {
            "reference": "Matthew 25:34-40",
            "kjv_text": "Then shall the King say unto them on his right hand, Come, ye blessed of my Father, inherit the kingdom prepared for you from the foundation of the world: For I was an hungred, and ye gave me meat: I was thirsty, and ye gave me drink: I was a stranger, and ye took me in: Naked, and ye clothed me: I was sick, and ye visited me: I was in prison, and ye came unto me. Then shall the righteous answer him, saying, Lord, when saw we thee an hungred, and fed thee? or thirsty, and gave thee  drink? When saw we thee a stranger, and took thee in? or naked, and clothed thee? Or when saw we thee sick, or in prison, and came unto thee? And the King shall answer and say unto them, Verily I say unto you, Inasmuch as ye have done it unto one of the least of these my brethren, ye have done it unto me.",
            "web_text": "Then the King will tell those on his right hand, ‘Come, blessed of my Father, inherit the Kingdom prepared for you from the foundation of the world;   for I was hungry, and you gave me food to eat. I was thirsty, and you gave me drink. I was a stranger, and you took me in.   I was naked, and you clothed me. I was sick, and you visited me. I was in prison, and you came to me.’  “Then the righteous will answer him, saying, ‘Lord, when did we see you hungry, and feed you; or thirsty, and give you a drink?   When did we see you as a stranger, and take you in; or naked, and clothe you?   When did we see you sick, or in prison, and come to you?’  “The King will answer them, ‘Most certainly I tell you, because you did it to one of the least of these my brothers,  you did it to me.’"
        }
    ],
    "notes": {
        "context": "Amos, a prophet of social justice, dismisses empty religious ceremony, calling instead for a torrent of righteousness. Jesus, in Matthew's Gospel, makes this personal and tangible: he states that serving the poor, the sick, and the imprisoned is equivalent to serving him directly.",
        "reflection": "Our love for God is directly measured by our love for the 'least of these.' Where can we let justice roll down like a river in our community?",
        "cross_references": [
            "Isaiah 1:17",
            "Proverbs 31:8-9",
            "Luke 4:18"
        ]
    }
}