{
    "folio_generated_utc": "2025-07-28T07:00:10.796372+00:00",
    "date": "July 28, 2025",
    "theme": "On The Shepherd & The Flock",
    "passages": [
        {
            "reference": "Psalm 23",
            "kjv_text": "The LORD is my shepherd; I shall not want. He maketh me to lie down in green pastures: he leadeth me beside the still waters. He restoreth my soul: he leadeth me in the paths of righteousness for his name’s sake. Yea, though I walk through the valley of the shadow of death, I will fear no evil: for thou art with me; thy rod and thy staff they comfort me. Thou preparest a table before me in the presence of mine enemies: thou anointest my head with oil; my cup runneth over. Surely goodness and mercy shall follow me all the days of my life: and I will dwell in the house of the LORD for ever.",
            "web_text": "Yahweh is my shepherd: I shall lack nothing. He makes me lie down in green pastures. He leads me beside still waters. He restores my soul. He guides me in the paths of righteousness for his name’s sake. Even though I walk through the valley of the shadow of death, I will fear no evil, for you are with me. Your rod and your staff, they comfort me. You prepare a table before me in the presence of my enemies. You anoint my head with oil. My cup runs over. Surely goodness and loving kindness shall follow me all the days of my life, and I will dwell in Yahweh’s house forever."
        },
        {
            "reference": "John 10:11-15",
            "kjv_text": "I am the good shepherd: the good shepherd giveth his life for the sheep. But he that is an hireling, and not the shepherd, whose own the sheep are not, seeth the wolf coming, and leaveth the sheep, and fleeth: and the wolf catcheth them, and scattereth the sheep. The hireling fleeth, because he is an hireling, and careth not for the sheep. I am the good shepherd, and know my sheep, and am known of mine. As the Father knoweth me, even so know I the Father: and I lay down my life for the sheep.",
            "web_text": "I am the good shepherd. The good shepherd lays down his life for the sheep.   He who is a hired hand, and not a shepherd, who doesn’t own the sheep, sees the wolf coming, leaves the sheep, and flees. The wolf snatches the sheep, and scatters them.   The hired hand flees because he is a hired hand, and doesn’t care for the sheep.   I am the good shepherd. I know my own, and I’m known by my own;   even as the Father knows me, and I know the Father. I lay down my life for the sheep."
        }
    ],
    "notes": {
        "context": "Psalm 23 is the most famous depiction of God as a personal, caring shepherd who provides, protects, and guides. Jesus explicitly claims this title for himself in John's Gospel, contrasting the 'good shepherd' who lays down his life for the sheep with the 'hired hand' who flees from danger.",
        "reflection": "The Shepherd knows his sheep by name. In a world of noise and anonymity, what does it mean to be known and cared for by a God who would lay down his life for us?",
        "cross_references": [
            "Isaiah 40:11",
            "Ezekiel 34:11-16",
            "1 Peter 5:2-4"
        ]
    }
}