{
    "date": "July 16, 2025",
    "theme": "On Humility & Service",
    "passages": [
        {
            "reference": "Micah 6:8",
            "kjv_text": "He hath shewed thee, O man, what\nis good; and what doth the LORD require of thee, but to do justly, and to love mercy, and to walk humbly with thy God?\n",
            "web_text": "He has shown you, O man, what is good.\nWhat does Yahweh require of you, but to act justly,\nto love mercy, and to walk humbly with your God?\n"
        },
        {
            "reference": "Philippians 2:3-8",
            "kjv_text": "Let nothing\nbe done through strife or vainglory; but in lowliness of mind let each esteem other better than themselves.\nLook not every man on his own things, but every man also on the things of others.\nLet this mind be in you, which was also in Christ Jesus:\nWho, being in the form of God, thought it not robbery to be equal with God:\nBut made himself of no reputation, and took upon him the form of a servant, and was made in the likeness of men:\nAnd being found in fashion as a man, he humbled himself, and became obedient unto death, even the death of the cross.\n",
            "web_text": "doing nothing through rivalry or through conceit, but in humility, each counting others better than himself;\neach of you not just looking to his own things, but each of you also to the things of others.\nHave this in your mind, which was also in Christ Jesus,\nwho, existing in the form of God, didn’t consider equality with God a thing to be grasped,\nbut emptied himself, taking the form of a servant, being made in the likeness of men.\nAnd being found in human form, he humbled himself, becoming obedient to death, yes, the death of the cross.\n"
        }
    ],
    "notes": {
        "context": "The prophet Micah boils down God's complex requirements into three simple actions: act justly, love mercy, and walk humbly. In Philippians, Paul presents Christ himself as the ultimate example of this humility, emptying himself and taking the form of a servant.",
        "reflection": "True greatness in the Kingdom of God is measured not by power or status, but by the depth of our service and the sincerity of our humility. How can we serve today?",
        "cross_references": [
            "Proverbs 22:4",
            "Matthew 23:12",
            "1 Peter 5:5-6"
        ]
    }
}