{
    "folio_generated_utc": "2025-07-23T07:16:24.762323+00:00",
    "date": "July 23, 2025",
    "theme": "On The Law & The Spirit",
    "passages": [
        {
            "reference": "Deuteronomy 6:4-9",
            "kjv_text": "Hear, O Israel: The LORD our God is one LORD: And thou shalt love the LORD thy God with all thine heart, and with all thy soul, and with all thy might. And these words, which I command thee this day, shall be in thine heart: And thou shalt teach them diligently unto thy children, and shalt talk of them when thou sittest in thine house, and when thou walkest by the way, and when thou liest down, and when thou risest up. And thou shalt bind them for a sign upon thine hand, and they shall be as frontlets between thine eyes. And thou shalt write them upon the posts of thy house, and on thy gates.",
            "web_text": "Hear, Israel: Yahweh is our God. Yahweh is one. You shall love Yahweh your God with all your heart, with all your soul, and with all your might. These words, which I command you today, shall be on your heart; and you shall teach them diligently to your children, and shall talk of them when you sit in your house, and when you walk by the way, and when you lie down, and when you rise up. You shall bind them for a sign on your hand, and they shall be for frontlets between your eyes. You shall write them on the door posts of your house, and on your gates."
        },
        {
            "reference": "Galatians 5:22-23",
            "kjv_text": "But the fruit of the Spirit is love, joy, peace, longsuffering, gentleness, goodness, faith, Meekness, temperance: against such there is no law.",
            "web_text": "But the fruit of the Spirit is love, joy, peace, patience, kindness, goodness, faith, gentleness, and self-control. Against such things there is no law."
        }
    ],
    "notes": {
        "context": "The 'Shema Yisrael' from Deuteronomy is the central commandment of Judaism, calling for a total, all-encompassing love for God. Paul, in Galatians, argues that for Christians, this state of love is not achieved by rigid adherence to law, but is a natural 'fruit' produced by the Holy Spirit dwelling within.",
        "reflection": "Are we trying to follow a checklist of rules, or are we cultivating an inner environment where the fruits of the Spirit can grow naturally?",
        "cross_references": [
            "Matthew 22:37-40",
            "Ezekiel 36:26-27",
            "Romans 8:4"
        ]
    }
}